dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC33xED/IfxSdmmc_bf.h
/** \brief Offset for Ifx_SDMMC_NORMAL_INT_STAT_EN_Bits.XFER_COMPLETE_STAT_EN */
#define IFX_SDMMC_NORMAL_INT_STAT_EN_XFER_COMPLETE_STAT_EN_OFF (1u)

/** \brief Length for Ifx_SDMMC_NORMAL_INT_STAT_EN_Bits.BGAP_EVENT_STAT_EN */
#define IFX_SDMMC_NORMAL_INT_STAT_EN_BGAP_EVENT_STAT_EN_LEN (1u)

/** \brief Mask for Ifx_SDMMC_NORMAL_INT_STAT_EN_Bits.BGAP_EVENT_STAT_EN */
#define IFX_SDMMC_NORMAL_INT_STAT_EN_BGAP_EVENT_STAT_EN_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_NORMAL_INT_STAT_EN_Bits.BGAP_EVENT_STAT_EN */
#define IFX_SDMMC_NORMAL_INT_STAT_EN_BGAP_EVENT_STAT_EN_OFF (2u)

/** \brief Length for Ifx_SDMMC_NORMAL_INT_STAT_EN_Bits.DMA_INTERRUPT_STAT_EN */
#define IFX_SDMMC_NORMAL_INT_STAT_EN_DMA_INTERRUPT_STAT_EN_LEN (1u)

/** \brief Mask for Ifx_SDMMC_NORMAL_INT_STAT_EN_Bits.DMA_INTERRUPT_STAT_EN */
#define IFX_SDMMC_NORMAL_INT_STAT_EN_DMA_INTERRUPT_STAT_EN_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_NORMAL_INT_STAT_EN_Bits.DMA_INTERRUPT_STAT_EN */
#define IFX_SDMMC_NORMAL_INT_STAT_EN_DMA_INTERRUPT_STAT_EN_OFF (3u)

/** \brief Length for Ifx_SDMMC_NORMAL_INT_STAT_EN_Bits.BUF_WR_READY_STAT_EN */
#define IFX_SDMMC_NORMAL_INT_STAT_EN_BUF_WR_READY_STAT_EN_LEN (1u)

/** \brief Mask for Ifx_SDMMC_NORMAL_INT_STAT_EN_Bits.BUF_WR_READY_STAT_EN */
#define IFX_SDMMC_NORMAL_INT_STAT_EN_BUF_WR_READY_STAT_EN_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_NORMAL_INT_STAT_EN_Bits.BUF_WR_READY_STAT_EN */
#define IFX_SDMMC_NORMAL_INT_STAT_EN_BUF_WR_READY_STAT_EN_OFF (4u)

/** \brief Length for Ifx_SDMMC_NORMAL_INT_STAT_EN_Bits.BUF_RD_READY_STAT_EN */
#define IFX_SDMMC_NORMAL_INT_STAT_EN_BUF_RD_READY_STAT_EN_LEN (1u)

/** \brief Mask for Ifx_SDMMC_NORMAL_INT_STAT_EN_Bits.BUF_RD_READY_STAT_EN */
#define IFX_SDMMC_NORMAL_INT_STAT_EN_BUF_RD_READY_STAT_EN_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_NORMAL_INT_STAT_EN_Bits.BUF_RD_READY_STAT_EN */
#define IFX_SDMMC_NORMAL_INT_STAT_EN_BUF_RD_READY_STAT_EN_OFF (5u)

/** \brief Length for Ifx_SDMMC_NORMAL_INT_STAT_EN_Bits.CARD_INSERTION_STAT_EN */
#define IFX_SDMMC_NORMAL_INT_STAT_EN_CARD_INSERTION_STAT_EN_LEN (1u)

/** \brief Mask for Ifx_SDMMC_NORMAL_INT_STAT_EN_Bits.CARD_INSERTION_STAT_EN */
#define IFX_SDMMC_NORMAL_INT_STAT_EN_CARD_INSERTION_STAT_EN_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_NORMAL_INT_STAT_EN_Bits.CARD_INSERTION_STAT_EN */
#define IFX_SDMMC_NORMAL_INT_STAT_EN_CARD_INSERTION_STAT_EN_OFF (6u)

/** \brief Length for Ifx_SDMMC_NORMAL_INT_STAT_EN_Bits.CARD_REMOVAL_STAT_EN */
#define IFX_SDMMC_NORMAL_INT_STAT_EN_CARD_REMOVAL_STAT_EN_LEN (1u)

/** \brief Mask for Ifx_SDMMC_NORMAL_INT_STAT_EN_Bits.CARD_REMOVAL_STAT_EN */
#define IFX_SDMMC_NORMAL_INT_STAT_EN_CARD_REMOVAL_STAT_EN_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_NORMAL_INT_STAT_EN_Bits.CARD_REMOVAL_STAT_EN */
#define IFX_SDMMC_NORMAL_INT_STAT_EN_CARD_REMOVAL_STAT_EN_OFF (7u)

/** \brief Length for Ifx_SDMMC_NORMAL_INT_STAT_EN_Bits.CARD_INTERRUPT_STAT_EN */
#define IFX_SDMMC_NORMAL_INT_STAT_EN_CARD_INTERRUPT_STAT_EN_LEN (1u)

/** \brief Mask for Ifx_SDMMC_NORMAL_INT_STAT_EN_Bits.CARD_INTERRUPT_STAT_EN */
#define IFX_SDMMC_NORMAL_INT_STAT_EN_CARD_INTERRUPT_STAT_EN_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_NORMAL_INT_STAT_EN_Bits.CARD_INTERRUPT_STAT_EN */
#define IFX_SDMMC_NORMAL_INT_STAT_EN_CARD_INTERRUPT_STAT_EN_OFF (8u)

/** \brief Length for Ifx_SDMMC_NORMAL_INT_STAT_EN_Bits.INT_A_STAT_EN */
#define IFX_SDMMC_NORMAL_INT_STAT_EN_INT_A_STAT_EN_LEN (1u)

/** \brief Mask for Ifx_SDMMC_NORMAL_INT_STAT_EN_Bits.INT_A_STAT_EN */
#define IFX_SDMMC_NORMAL_INT_STAT_EN_INT_A_STAT_EN_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_NORMAL_INT_STAT_EN_Bits.INT_A_STAT_EN */
#define IFX_SDMMC_NORMAL_INT_STAT_EN_INT_A_STAT_EN_OFF (9u)

/** \brief Length for Ifx_SDMMC_NORMAL_INT_STAT_EN_Bits.INT_B_STAT_EN */
#define IFX_SDMMC_NORMAL_INT_STAT_EN_INT_B_STAT_EN_LEN (1u)

/** \brief Mask for Ifx_SDMMC_NORMAL_INT_STAT_EN_Bits.INT_B_STAT_EN */
#define IFX_SDMMC_NORMAL_INT_STAT_EN_INT_B_STAT_EN_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_NORMAL_INT_STAT_EN_Bits.INT_B_STAT_EN */
#define IFX_SDMMC_NORMAL_INT_STAT_EN_INT_B_STAT_EN_OFF (10u)

/** \brief Length for Ifx_SDMMC_NORMAL_INT_STAT_EN_Bits.INT_C_STAT_EN */
#define IFX_SDMMC_NORMAL_INT_STAT_EN_INT_C_STAT_EN_LEN (1u)

/** \brief Mask for Ifx_SDMMC_NORMAL_INT_STAT_EN_Bits.INT_C_STAT_EN */
#define IFX_SDMMC_NORMAL_INT_STAT_EN_INT_C_STAT_EN_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_NORMAL_INT_STAT_EN_Bits.INT_C_STAT_EN */
#define IFX_SDMMC_NORMAL_INT_STAT_EN_INT_C_STAT_EN_OFF (11u)

/** \brief Length for Ifx_SDMMC_NORMAL_INT_STAT_EN_Bits.RE_TUNE_EVENT_STAT_EN */
#define IFX_SDMMC_NORMAL_INT_STAT_EN_RE_TUNE_EVENT_STAT_EN_LEN (1u)

/** \brief Mask for Ifx_SDMMC_NORMAL_INT_STAT_EN_Bits.RE_TUNE_EVENT_STAT_EN */
#define IFX_SDMMC_NORMAL_INT_STAT_EN_RE_TUNE_EVENT_STAT_EN_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_NORMAL_INT_STAT_EN_Bits.RE_TUNE_EVENT_STAT_EN */
#define IFX_SDMMC_NORMAL_INT_STAT_EN_RE_TUNE_EVENT_STAT_EN_OFF (12u)

/** \brief Length for Ifx_SDMMC_NORMAL_INT_STAT_EN_Bits.FX_EVENT_STAT_EN */
#define IFX_SDMMC_NORMAL_INT_STAT_EN_FX_EVENT_STAT_EN_LEN (1u)

/** \brief Mask for Ifx_SDMMC_NORMAL_INT_STAT_EN_Bits.FX_EVENT_STAT_EN */
#define IFX_SDMMC_NORMAL_INT_STAT_EN_FX_EVENT_STAT_EN_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_NORMAL_INT_STAT_EN_Bits.FX_EVENT_STAT_EN */
#define IFX_SDMMC_NORMAL_INT_STAT_EN_FX_EVENT_STAT_EN_OFF (13u)

/** \brief Length for Ifx_SDMMC_NORMAL_INT_STAT_EN_Bits.CQE_EVENT_STAT_EN */
#define IFX_SDMMC_NORMAL_INT_STAT_EN_CQE_EVENT_STAT_EN_LEN (1u)

/** \brief Mask for Ifx_SDMMC_NORMAL_INT_STAT_EN_Bits.CQE_EVENT_STAT_EN */
#define IFX_SDMMC_NORMAL_INT_STAT_EN_CQE_EVENT_STAT_EN_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_NORMAL_INT_STAT_EN_Bits.CQE_EVENT_STAT_EN */
#define IFX_SDMMC_NORMAL_INT_STAT_EN_CQE_EVENT_STAT_EN_OFF (14u)

/** \brief Length for Ifx_SDMMC_ERROR_INT_STAT_EN_Bits.CMD_TOUT_ERR_STAT_EN */
#define IFX_SDMMC_ERROR_INT_STAT_EN_CMD_TOUT_ERR_STAT_EN_LEN (1u)

/** \brief Mask for Ifx_SDMMC_ERROR_INT_STAT_EN_Bits.CMD_TOUT_ERR_STAT_EN */
#define IFX_SDMMC_ERROR_INT_STAT_EN_CMD_TOUT_ERR_STAT_EN_MSK (0x1u)

