dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC33xED/IfxSdmmc_bf.h
/** \brief Mask for Ifx_SDMMC_NORMAL_INT_SIGNAL_EN_Bits.BGAP_EVENT_SIGNAL_EN */
#define IFX_SDMMC_NORMAL_INT_SIGNAL_EN_BGAP_EVENT_SIGNAL_EN_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_NORMAL_INT_SIGNAL_EN_Bits.BGAP_EVENT_SIGNAL_EN */
#define IFX_SDMMC_NORMAL_INT_SIGNAL_EN_BGAP_EVENT_SIGNAL_EN_OFF (2u)

/** \brief Length for Ifx_SDMMC_NORMAL_INT_SIGNAL_EN_Bits.DMA_INTERRUPT_SIGNAL_EN */
#define IFX_SDMMC_NORMAL_INT_SIGNAL_EN_DMA_INTERRUPT_SIGNAL_EN_LEN (1u)

/** \brief Mask for Ifx_SDMMC_NORMAL_INT_SIGNAL_EN_Bits.DMA_INTERRUPT_SIGNAL_EN */
#define IFX_SDMMC_NORMAL_INT_SIGNAL_EN_DMA_INTERRUPT_SIGNAL_EN_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_NORMAL_INT_SIGNAL_EN_Bits.DMA_INTERRUPT_SIGNAL_EN */
#define IFX_SDMMC_NORMAL_INT_SIGNAL_EN_DMA_INTERRUPT_SIGNAL_EN_OFF (3u)

/** \brief Length for Ifx_SDMMC_NORMAL_INT_SIGNAL_EN_Bits.BUF_WR_READY_SIGNAL_EN */
#define IFX_SDMMC_NORMAL_INT_SIGNAL_EN_BUF_WR_READY_SIGNAL_EN_LEN (1u)

/** \brief Mask for Ifx_SDMMC_NORMAL_INT_SIGNAL_EN_Bits.BUF_WR_READY_SIGNAL_EN */
#define IFX_SDMMC_NORMAL_INT_SIGNAL_EN_BUF_WR_READY_SIGNAL_EN_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_NORMAL_INT_SIGNAL_EN_Bits.BUF_WR_READY_SIGNAL_EN */
#define IFX_SDMMC_NORMAL_INT_SIGNAL_EN_BUF_WR_READY_SIGNAL_EN_OFF (4u)

/** \brief Length for Ifx_SDMMC_NORMAL_INT_SIGNAL_EN_Bits.BUF_RD_READY_SIGNAL_EN */
#define IFX_SDMMC_NORMAL_INT_SIGNAL_EN_BUF_RD_READY_SIGNAL_EN_LEN (1u)

/** \brief Mask for Ifx_SDMMC_NORMAL_INT_SIGNAL_EN_Bits.BUF_RD_READY_SIGNAL_EN */
#define IFX_SDMMC_NORMAL_INT_SIGNAL_EN_BUF_RD_READY_SIGNAL_EN_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_NORMAL_INT_SIGNAL_EN_Bits.BUF_RD_READY_SIGNAL_EN */
#define IFX_SDMMC_NORMAL_INT_SIGNAL_EN_BUF_RD_READY_SIGNAL_EN_OFF (5u)

/** \brief Length for Ifx_SDMMC_NORMAL_INT_SIGNAL_EN_Bits.CARD_INSERTION_SIGNAL_EN */
#define IFX_SDMMC_NORMAL_INT_SIGNAL_EN_CARD_INSERTION_SIGNAL_EN_LEN (1u)

/** \brief Mask for Ifx_SDMMC_NORMAL_INT_SIGNAL_EN_Bits.CARD_INSERTION_SIGNAL_EN */
#define IFX_SDMMC_NORMAL_INT_SIGNAL_EN_CARD_INSERTION_SIGNAL_EN_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_NORMAL_INT_SIGNAL_EN_Bits.CARD_INSERTION_SIGNAL_EN */
#define IFX_SDMMC_NORMAL_INT_SIGNAL_EN_CARD_INSERTION_SIGNAL_EN_OFF (6u)

/** \brief Length for Ifx_SDMMC_NORMAL_INT_SIGNAL_EN_Bits.CARD_REMOVAL_SIGNAL_EN */
#define IFX_SDMMC_NORMAL_INT_SIGNAL_EN_CARD_REMOVAL_SIGNAL_EN_LEN (1u)

/** \brief Mask for Ifx_SDMMC_NORMAL_INT_SIGNAL_EN_Bits.CARD_REMOVAL_SIGNAL_EN */
#define IFX_SDMMC_NORMAL_INT_SIGNAL_EN_CARD_REMOVAL_SIGNAL_EN_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_NORMAL_INT_SIGNAL_EN_Bits.CARD_REMOVAL_SIGNAL_EN */
#define IFX_SDMMC_NORMAL_INT_SIGNAL_EN_CARD_REMOVAL_SIGNAL_EN_OFF (7u)

/** \brief Length for Ifx_SDMMC_NORMAL_INT_SIGNAL_EN_Bits.CARD_INTERRUPT_SIGNAL_EN */
#define IFX_SDMMC_NORMAL_INT_SIGNAL_EN_CARD_INTERRUPT_SIGNAL_EN_LEN (1u)

/** \brief Mask for Ifx_SDMMC_NORMAL_INT_SIGNAL_EN_Bits.CARD_INTERRUPT_SIGNAL_EN */
#define IFX_SDMMC_NORMAL_INT_SIGNAL_EN_CARD_INTERRUPT_SIGNAL_EN_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_NORMAL_INT_SIGNAL_EN_Bits.CARD_INTERRUPT_SIGNAL_EN */
#define IFX_SDMMC_NORMAL_INT_SIGNAL_EN_CARD_INTERRUPT_SIGNAL_EN_OFF (8u)

/** \brief Length for Ifx_SDMMC_NORMAL_INT_SIGNAL_EN_Bits.INT_A_SIGNAL_EN */
#define IFX_SDMMC_NORMAL_INT_SIGNAL_EN_INT_A_SIGNAL_EN_LEN (1u)

/** \brief Mask for Ifx_SDMMC_NORMAL_INT_SIGNAL_EN_Bits.INT_A_SIGNAL_EN */
#define IFX_SDMMC_NORMAL_INT_SIGNAL_EN_INT_A_SIGNAL_EN_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_NORMAL_INT_SIGNAL_EN_Bits.INT_A_SIGNAL_EN */
#define IFX_SDMMC_NORMAL_INT_SIGNAL_EN_INT_A_SIGNAL_EN_OFF (9u)

/** \brief Length for Ifx_SDMMC_NORMAL_INT_SIGNAL_EN_Bits.INT_B_SIGNAL_EN */
#define IFX_SDMMC_NORMAL_INT_SIGNAL_EN_INT_B_SIGNAL_EN_LEN (1u)

/** \brief Mask for Ifx_SDMMC_NORMAL_INT_SIGNAL_EN_Bits.INT_B_SIGNAL_EN */
#define IFX_SDMMC_NORMAL_INT_SIGNAL_EN_INT_B_SIGNAL_EN_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_NORMAL_INT_SIGNAL_EN_Bits.INT_B_SIGNAL_EN */
#define IFX_SDMMC_NORMAL_INT_SIGNAL_EN_INT_B_SIGNAL_EN_OFF (10u)

/** \brief Length for Ifx_SDMMC_NORMAL_INT_SIGNAL_EN_Bits.INT_C_SIGNAL_EN */
#define IFX_SDMMC_NORMAL_INT_SIGNAL_EN_INT_C_SIGNAL_EN_LEN (1u)

/** \brief Mask for Ifx_SDMMC_NORMAL_INT_SIGNAL_EN_Bits.INT_C_SIGNAL_EN */
#define IFX_SDMMC_NORMAL_INT_SIGNAL_EN_INT_C_SIGNAL_EN_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_NORMAL_INT_SIGNAL_EN_Bits.INT_C_SIGNAL_EN */
#define IFX_SDMMC_NORMAL_INT_SIGNAL_EN_INT_C_SIGNAL_EN_OFF (11u)

/** \brief Length for Ifx_SDMMC_NORMAL_INT_SIGNAL_EN_Bits.RE_TUNE_EVENT_SIGNAL_EN */
#define IFX_SDMMC_NORMAL_INT_SIGNAL_EN_RE_TUNE_EVENT_SIGNAL_EN_LEN (1u)

/** \brief Mask for Ifx_SDMMC_NORMAL_INT_SIGNAL_EN_Bits.RE_TUNE_EVENT_SIGNAL_EN */
#define IFX_SDMMC_NORMAL_INT_SIGNAL_EN_RE_TUNE_EVENT_SIGNAL_EN_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_NORMAL_INT_SIGNAL_EN_Bits.RE_TUNE_EVENT_SIGNAL_EN */
#define IFX_SDMMC_NORMAL_INT_SIGNAL_EN_RE_TUNE_EVENT_SIGNAL_EN_OFF (12u)

/** \brief Length for Ifx_SDMMC_NORMAL_INT_SIGNAL_EN_Bits.FX_EVENT_SIGNAL_EN */
#define IFX_SDMMC_NORMAL_INT_SIGNAL_EN_FX_EVENT_SIGNAL_EN_LEN (1u)

/** \brief Mask for Ifx_SDMMC_NORMAL_INT_SIGNAL_EN_Bits.FX_EVENT_SIGNAL_EN */
#define IFX_SDMMC_NORMAL_INT_SIGNAL_EN_FX_EVENT_SIGNAL_EN_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_NORMAL_INT_SIGNAL_EN_Bits.FX_EVENT_SIGNAL_EN */
#define IFX_SDMMC_NORMAL_INT_SIGNAL_EN_FX_EVENT_SIGNAL_EN_OFF (13u)

/** \brief Length for Ifx_SDMMC_NORMAL_INT_SIGNAL_EN_Bits.CQE_EVENT_SIGNAL_EN */
#define IFX_SDMMC_NORMAL_INT_SIGNAL_EN_CQE_EVENT_SIGNAL_EN_LEN (1u)

/** \brief Mask for Ifx_SDMMC_NORMAL_INT_SIGNAL_EN_Bits.CQE_EVENT_SIGNAL_EN */
#define IFX_SDMMC_NORMAL_INT_SIGNAL_EN_CQE_EVENT_SIGNAL_EN_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_NORMAL_INT_SIGNAL_EN_Bits.CQE_EVENT_SIGNAL_EN */
#define IFX_SDMMC_NORMAL_INT_SIGNAL_EN_CQE_EVENT_SIGNAL_EN_OFF (14u)

/** \brief Length for Ifx_SDMMC_ERROR_INT_SIGNAL_EN_Bits.CMD_TOUT_ERR_SIGNAL_EN */
#define IFX_SDMMC_ERROR_INT_SIGNAL_EN_CMD_TOUT_ERR_SIGNAL_EN_LEN (1u)

/** \brief Mask for Ifx_SDMMC_ERROR_INT_SIGNAL_EN_Bits.CMD_TOUT_ERR_SIGNAL_EN */
#define IFX_SDMMC_ERROR_INT_SIGNAL_EN_CMD_TOUT_ERR_SIGNAL_EN_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_ERROR_INT_SIGNAL_EN_Bits.CMD_TOUT_ERR_SIGNAL_EN */
#define IFX_SDMMC_ERROR_INT_SIGNAL_EN_CMD_TOUT_ERR_SIGNAL_EN_OFF (0u)

/** \brief Length for Ifx_SDMMC_ERROR_INT_SIGNAL_EN_Bits.CMD_CRC_ERR_SIGNAL_EN */
#define IFX_SDMMC_ERROR_INT_SIGNAL_EN_CMD_CRC_ERR_SIGNAL_EN_LEN (1u)

/** \brief Mask for Ifx_SDMMC_ERROR_INT_SIGNAL_EN_Bits.CMD_CRC_ERR_SIGNAL_EN */
#define IFX_SDMMC_ERROR_INT_SIGNAL_EN_CMD_CRC_ERR_SIGNAL_EN_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_ERROR_INT_SIGNAL_EN_Bits.CMD_CRC_ERR_SIGNAL_EN */
#define IFX_SDMMC_ERROR_INT_SIGNAL_EN_CMD_CRC_ERR_SIGNAL_EN_OFF (1u)

/** \brief Length for Ifx_SDMMC_ERROR_INT_SIGNAL_EN_Bits.CMD_END_BIT_ERR_SIGNAL_EN */
#define IFX_SDMMC_ERROR_INT_SIGNAL_EN_CMD_END_BIT_ERR_SIGNAL_EN_LEN (1u)

/** \brief Mask for Ifx_SDMMC_ERROR_INT_SIGNAL_EN_Bits.CMD_END_BIT_ERR_SIGNAL_EN */
#define IFX_SDMMC_ERROR_INT_SIGNAL_EN_CMD_END_BIT_ERR_SIGNAL_EN_MSK (0x1u)

