dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC33xED/IfxSdmmc_bf.h
/** \brief Mask for Ifx_SDMMC_CAPABILITIES1_Bits.BASE_CLK_FREQ */
#define IFX_SDMMC_CAPABILITIES1_BASE_CLK_FREQ_MSK (0xffu)

/** \brief Offset for Ifx_SDMMC_CAPABILITIES1_Bits.BASE_CLK_FREQ */
#define IFX_SDMMC_CAPABILITIES1_BASE_CLK_FREQ_OFF (8u)

/** \brief Length for Ifx_SDMMC_CAPABILITIES1_Bits.MAX_BLK_LEN */
#define IFX_SDMMC_CAPABILITIES1_MAX_BLK_LEN_LEN (2u)

/** \brief Mask for Ifx_SDMMC_CAPABILITIES1_Bits.MAX_BLK_LEN */
#define IFX_SDMMC_CAPABILITIES1_MAX_BLK_LEN_MSK (0x3u)

/** \brief Offset for Ifx_SDMMC_CAPABILITIES1_Bits.MAX_BLK_LEN */
#define IFX_SDMMC_CAPABILITIES1_MAX_BLK_LEN_OFF (16u)

/** \brief Length for Ifx_SDMMC_CAPABILITIES1_Bits.Embedded_8_BIT */
#define IFX_SDMMC_CAPABILITIES1_EMBEDDED_8_BIT_LEN (1u)

/** \brief Mask for Ifx_SDMMC_CAPABILITIES1_Bits.Embedded_8_BIT */
#define IFX_SDMMC_CAPABILITIES1_EMBEDDED_8_BIT_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_CAPABILITIES1_Bits.Embedded_8_BIT */
#define IFX_SDMMC_CAPABILITIES1_EMBEDDED_8_BIT_OFF (18u)

/** \brief Length for Ifx_SDMMC_CAPABILITIES1_Bits.ADMA2_SUPPORT */
#define IFX_SDMMC_CAPABILITIES1_ADMA2_SUPPORT_LEN (1u)

/** \brief Mask for Ifx_SDMMC_CAPABILITIES1_Bits.ADMA2_SUPPORT */
#define IFX_SDMMC_CAPABILITIES1_ADMA2_SUPPORT_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_CAPABILITIES1_Bits.ADMA2_SUPPORT */
#define IFX_SDMMC_CAPABILITIES1_ADMA2_SUPPORT_OFF (19u)

/** \brief Length for Ifx_SDMMC_CAPABILITIES1_Bits.HIGH_SPEED_SUPPORT */
#define IFX_SDMMC_CAPABILITIES1_HIGH_SPEED_SUPPORT_LEN (1u)

/** \brief Mask for Ifx_SDMMC_CAPABILITIES1_Bits.HIGH_SPEED_SUPPORT */
#define IFX_SDMMC_CAPABILITIES1_HIGH_SPEED_SUPPORT_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_CAPABILITIES1_Bits.HIGH_SPEED_SUPPORT */
#define IFX_SDMMC_CAPABILITIES1_HIGH_SPEED_SUPPORT_OFF (21u)

/** \brief Length for Ifx_SDMMC_CAPABILITIES1_Bits.SDMA_SUPPORT */
#define IFX_SDMMC_CAPABILITIES1_SDMA_SUPPORT_LEN (1u)

/** \brief Mask for Ifx_SDMMC_CAPABILITIES1_Bits.SDMA_SUPPORT */
#define IFX_SDMMC_CAPABILITIES1_SDMA_SUPPORT_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_CAPABILITIES1_Bits.SDMA_SUPPORT */
#define IFX_SDMMC_CAPABILITIES1_SDMA_SUPPORT_OFF (22u)

/** \brief Length for Ifx_SDMMC_CAPABILITIES1_Bits.SUS_RES_SUPPORT */
#define IFX_SDMMC_CAPABILITIES1_SUS_RES_SUPPORT_LEN (1u)

/** \brief Mask for Ifx_SDMMC_CAPABILITIES1_Bits.SUS_RES_SUPPORT */
#define IFX_SDMMC_CAPABILITIES1_SUS_RES_SUPPORT_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_CAPABILITIES1_Bits.SUS_RES_SUPPORT */
#define IFX_SDMMC_CAPABILITIES1_SUS_RES_SUPPORT_OFF (23u)

/** \brief Length for Ifx_SDMMC_CAPABILITIES1_Bits.VOLT_33 */
#define IFX_SDMMC_CAPABILITIES1_VOLT_33_LEN (1u)

/** \brief Mask for Ifx_SDMMC_CAPABILITIES1_Bits.VOLT_33 */
#define IFX_SDMMC_CAPABILITIES1_VOLT_33_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_CAPABILITIES1_Bits.VOLT_33 */
#define IFX_SDMMC_CAPABILITIES1_VOLT_33_OFF (24u)

/** \brief Length for Ifx_SDMMC_CAPABILITIES1_Bits.VOLT_30 */
#define IFX_SDMMC_CAPABILITIES1_VOLT_30_LEN (1u)

/** \brief Mask for Ifx_SDMMC_CAPABILITIES1_Bits.VOLT_30 */
#define IFX_SDMMC_CAPABILITIES1_VOLT_30_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_CAPABILITIES1_Bits.VOLT_30 */
#define IFX_SDMMC_CAPABILITIES1_VOLT_30_OFF (25u)

/** \brief Length for Ifx_SDMMC_CAPABILITIES1_Bits.VOLT_18 */
#define IFX_SDMMC_CAPABILITIES1_VOLT_18_LEN (1u)

/** \brief Mask for Ifx_SDMMC_CAPABILITIES1_Bits.VOLT_18 */
#define IFX_SDMMC_CAPABILITIES1_VOLT_18_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_CAPABILITIES1_Bits.VOLT_18 */
#define IFX_SDMMC_CAPABILITIES1_VOLT_18_OFF (26u)

/** \brief Length for Ifx_SDMMC_CAPABILITIES1_Bits.SYS_ADDR_64_V4 */
#define IFX_SDMMC_CAPABILITIES1_SYS_ADDR_64_V4_LEN (1u)

/** \brief Mask for Ifx_SDMMC_CAPABILITIES1_Bits.SYS_ADDR_64_V4 */
#define IFX_SDMMC_CAPABILITIES1_SYS_ADDR_64_V4_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_CAPABILITIES1_Bits.SYS_ADDR_64_V4 */
#define IFX_SDMMC_CAPABILITIES1_SYS_ADDR_64_V4_OFF (27u)

/** \brief Length for Ifx_SDMMC_CAPABILITIES1_Bits.SYS_ADDR_64_V3 */
#define IFX_SDMMC_CAPABILITIES1_SYS_ADDR_64_V3_LEN (1u)

/** \brief Mask for Ifx_SDMMC_CAPABILITIES1_Bits.SYS_ADDR_64_V3 */
#define IFX_SDMMC_CAPABILITIES1_SYS_ADDR_64_V3_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_CAPABILITIES1_Bits.SYS_ADDR_64_V3 */
#define IFX_SDMMC_CAPABILITIES1_SYS_ADDR_64_V3_OFF (28u)

/** \brief Length for Ifx_SDMMC_CAPABILITIES1_Bits.ASYNC_INT_SUPPORT */
#define IFX_SDMMC_CAPABILITIES1_ASYNC_INT_SUPPORT_LEN (1u)

/** \brief Mask for Ifx_SDMMC_CAPABILITIES1_Bits.ASYNC_INT_SUPPORT */
#define IFX_SDMMC_CAPABILITIES1_ASYNC_INT_SUPPORT_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_CAPABILITIES1_Bits.ASYNC_INT_SUPPORT */
#define IFX_SDMMC_CAPABILITIES1_ASYNC_INT_SUPPORT_OFF (29u)

/** \brief Length for Ifx_SDMMC_CAPABILITIES1_Bits.SLOT_TYPE */
#define IFX_SDMMC_CAPABILITIES1_SLOT_TYPE_LEN (2u)

/** \brief Mask for Ifx_SDMMC_CAPABILITIES1_Bits.SLOT_TYPE */
#define IFX_SDMMC_CAPABILITIES1_SLOT_TYPE_MSK (0x3u)

/** \brief Offset for Ifx_SDMMC_CAPABILITIES1_Bits.SLOT_TYPE */
#define IFX_SDMMC_CAPABILITIES1_SLOT_TYPE_OFF (30u)

/** \brief Length for Ifx_SDMMC_CAPABILITIES2_Bits.SDR50_SUPPORT */
#define IFX_SDMMC_CAPABILITIES2_SDR50_SUPPORT_LEN (1u)

/** \brief Mask for Ifx_SDMMC_CAPABILITIES2_Bits.SDR50_SUPPORT */
#define IFX_SDMMC_CAPABILITIES2_SDR50_SUPPORT_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_CAPABILITIES2_Bits.SDR50_SUPPORT */
#define IFX_SDMMC_CAPABILITIES2_SDR50_SUPPORT_OFF (0u)

/** \brief Length for Ifx_SDMMC_CAPABILITIES2_Bits.SDR104_SUPPORT */
#define IFX_SDMMC_CAPABILITIES2_SDR104_SUPPORT_LEN (1u)

/** \brief Mask for Ifx_SDMMC_CAPABILITIES2_Bits.SDR104_SUPPORT */
#define IFX_SDMMC_CAPABILITIES2_SDR104_SUPPORT_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_CAPABILITIES2_Bits.SDR104_SUPPORT */
#define IFX_SDMMC_CAPABILITIES2_SDR104_SUPPORT_OFF (1u)

/** \brief Length for Ifx_SDMMC_CAPABILITIES2_Bits.DDR50_SUPPORT */
#define IFX_SDMMC_CAPABILITIES2_DDR50_SUPPORT_LEN (1u)

/** \brief Mask for Ifx_SDMMC_CAPABILITIES2_Bits.DDR50_SUPPORT */
#define IFX_SDMMC_CAPABILITIES2_DDR50_SUPPORT_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_CAPABILITIES2_Bits.DDR50_SUPPORT */
#define IFX_SDMMC_CAPABILITIES2_DDR50_SUPPORT_OFF (2u)

