dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC33xED/IfxSdmmc_bf.h
/** \brief Length for Ifx_SDMMC_CAPABILITIES2_Bits.UHS2_SUPPORT */
#define IFX_SDMMC_CAPABILITIES2_UHS2_SUPPORT_LEN (1u)

/** \brief Mask for Ifx_SDMMC_CAPABILITIES2_Bits.UHS2_SUPPORT */
#define IFX_SDMMC_CAPABILITIES2_UHS2_SUPPORT_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_CAPABILITIES2_Bits.UHS2_SUPPORT */
#define IFX_SDMMC_CAPABILITIES2_UHS2_SUPPORT_OFF (3u)

/** \brief Length for Ifx_SDMMC_CAPABILITIES2_Bits.DRV_TYPEA */
#define IFX_SDMMC_CAPABILITIES2_DRV_TYPEA_LEN (1u)

/** \brief Mask for Ifx_SDMMC_CAPABILITIES2_Bits.DRV_TYPEA */
#define IFX_SDMMC_CAPABILITIES2_DRV_TYPEA_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_CAPABILITIES2_Bits.DRV_TYPEA */
#define IFX_SDMMC_CAPABILITIES2_DRV_TYPEA_OFF (4u)

/** \brief Length for Ifx_SDMMC_CAPABILITIES2_Bits.DRV_TYPEC */
#define IFX_SDMMC_CAPABILITIES2_DRV_TYPEC_LEN (1u)

/** \brief Mask for Ifx_SDMMC_CAPABILITIES2_Bits.DRV_TYPEC */
#define IFX_SDMMC_CAPABILITIES2_DRV_TYPEC_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_CAPABILITIES2_Bits.DRV_TYPEC */
#define IFX_SDMMC_CAPABILITIES2_DRV_TYPEC_OFF (5u)

/** \brief Length for Ifx_SDMMC_CAPABILITIES2_Bits.DRV_TYPED */
#define IFX_SDMMC_CAPABILITIES2_DRV_TYPED_LEN (1u)

/** \brief Mask for Ifx_SDMMC_CAPABILITIES2_Bits.DRV_TYPED */
#define IFX_SDMMC_CAPABILITIES2_DRV_TYPED_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_CAPABILITIES2_Bits.DRV_TYPED */
#define IFX_SDMMC_CAPABILITIES2_DRV_TYPED_OFF (6u)

/** \brief Length for Ifx_SDMMC_CAPABILITIES2_Bits.RETUNE_CNT */
#define IFX_SDMMC_CAPABILITIES2_RETUNE_CNT_LEN (4u)

/** \brief Mask for Ifx_SDMMC_CAPABILITIES2_Bits.RETUNE_CNT */
#define IFX_SDMMC_CAPABILITIES2_RETUNE_CNT_MSK (0xfu)

/** \brief Offset for Ifx_SDMMC_CAPABILITIES2_Bits.RETUNE_CNT */
#define IFX_SDMMC_CAPABILITIES2_RETUNE_CNT_OFF (8u)

/** \brief Length for Ifx_SDMMC_CAPABILITIES2_Bits.USE_TUNING_SDR50 */
#define IFX_SDMMC_CAPABILITIES2_USE_TUNING_SDR50_LEN (1u)

/** \brief Mask for Ifx_SDMMC_CAPABILITIES2_Bits.USE_TUNING_SDR50 */
#define IFX_SDMMC_CAPABILITIES2_USE_TUNING_SDR50_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_CAPABILITIES2_Bits.USE_TUNING_SDR50 */
#define IFX_SDMMC_CAPABILITIES2_USE_TUNING_SDR50_OFF (13u)

/** \brief Length for Ifx_SDMMC_CAPABILITIES2_Bits.RE_TUNING_MODES */
#define IFX_SDMMC_CAPABILITIES2_RE_TUNING_MODES_LEN (2u)

/** \brief Mask for Ifx_SDMMC_CAPABILITIES2_Bits.RE_TUNING_MODES */
#define IFX_SDMMC_CAPABILITIES2_RE_TUNING_MODES_MSK (0x3u)

/** \brief Offset for Ifx_SDMMC_CAPABILITIES2_Bits.RE_TUNING_MODES */
#define IFX_SDMMC_CAPABILITIES2_RE_TUNING_MODES_OFF (14u)

/** \brief Length for Ifx_SDMMC_CAPABILITIES2_Bits.CLK_MUL */
#define IFX_SDMMC_CAPABILITIES2_CLK_MUL_LEN (8u)

/** \brief Mask for Ifx_SDMMC_CAPABILITIES2_Bits.CLK_MUL */
#define IFX_SDMMC_CAPABILITIES2_CLK_MUL_MSK (0xffu)

/** \brief Offset for Ifx_SDMMC_CAPABILITIES2_Bits.CLK_MUL */
#define IFX_SDMMC_CAPABILITIES2_CLK_MUL_OFF (16u)

/** \brief Length for Ifx_SDMMC_CAPABILITIES2_Bits.ADMA3_SUPPORT */
#define IFX_SDMMC_CAPABILITIES2_ADMA3_SUPPORT_LEN (1u)

/** \brief Mask for Ifx_SDMMC_CAPABILITIES2_Bits.ADMA3_SUPPORT */
#define IFX_SDMMC_CAPABILITIES2_ADMA3_SUPPORT_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_CAPABILITIES2_Bits.ADMA3_SUPPORT */
#define IFX_SDMMC_CAPABILITIES2_ADMA3_SUPPORT_OFF (27u)

/** \brief Length for Ifx_SDMMC_CAPABILITIES2_Bits.VDD2_18V_SUPPORT */
#define IFX_SDMMC_CAPABILITIES2_VDD2_18V_SUPPORT_LEN (1u)

/** \brief Mask for Ifx_SDMMC_CAPABILITIES2_Bits.VDD2_18V_SUPPORT */
#define IFX_SDMMC_CAPABILITIES2_VDD2_18V_SUPPORT_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_CAPABILITIES2_Bits.VDD2_18V_SUPPORT */
#define IFX_SDMMC_CAPABILITIES2_VDD2_18V_SUPPORT_OFF (28u)

/** \brief Length for Ifx_SDMMC_CURR_CAPABILITIES1_Bits.MAX_CUR_33V */
#define IFX_SDMMC_CURR_CAPABILITIES1_MAX_CUR_33V_LEN (8u)

/** \brief Mask for Ifx_SDMMC_CURR_CAPABILITIES1_Bits.MAX_CUR_33V */
#define IFX_SDMMC_CURR_CAPABILITIES1_MAX_CUR_33V_MSK (0xffu)

/** \brief Offset for Ifx_SDMMC_CURR_CAPABILITIES1_Bits.MAX_CUR_33V */
#define IFX_SDMMC_CURR_CAPABILITIES1_MAX_CUR_33V_OFF (0u)

/** \brief Length for Ifx_SDMMC_CURR_CAPABILITIES1_Bits.MAX_CUR_30V */
#define IFX_SDMMC_CURR_CAPABILITIES1_MAX_CUR_30V_LEN (8u)

/** \brief Mask for Ifx_SDMMC_CURR_CAPABILITIES1_Bits.MAX_CUR_30V */
#define IFX_SDMMC_CURR_CAPABILITIES1_MAX_CUR_30V_MSK (0xffu)

/** \brief Offset for Ifx_SDMMC_CURR_CAPABILITIES1_Bits.MAX_CUR_30V */
#define IFX_SDMMC_CURR_CAPABILITIES1_MAX_CUR_30V_OFF (8u)

/** \brief Length for Ifx_SDMMC_CURR_CAPABILITIES1_Bits.MAX_CUR_18V */
#define IFX_SDMMC_CURR_CAPABILITIES1_MAX_CUR_18V_LEN (8u)

/** \brief Mask for Ifx_SDMMC_CURR_CAPABILITIES1_Bits.MAX_CUR_18V */
#define IFX_SDMMC_CURR_CAPABILITIES1_MAX_CUR_18V_MSK (0xffu)

/** \brief Offset for Ifx_SDMMC_CURR_CAPABILITIES1_Bits.MAX_CUR_18V */
#define IFX_SDMMC_CURR_CAPABILITIES1_MAX_CUR_18V_OFF (16u)

/** \brief Length for Ifx_SDMMC_CURR_CAPABILITIES2_Bits.MAX_CUR_VDD2_18V */
#define IFX_SDMMC_CURR_CAPABILITIES2_MAX_CUR_VDD2_18V_LEN (8u)

/** \brief Mask for Ifx_SDMMC_CURR_CAPABILITIES2_Bits.MAX_CUR_VDD2_18V */
#define IFX_SDMMC_CURR_CAPABILITIES2_MAX_CUR_VDD2_18V_MSK (0xffu)

/** \brief Offset for Ifx_SDMMC_CURR_CAPABILITIES2_Bits.MAX_CUR_VDD2_18V */
#define IFX_SDMMC_CURR_CAPABILITIES2_MAX_CUR_VDD2_18V_OFF (0u)

/** \brief Length for Ifx_SDMMC_FORCE_AUTO_CMD_STAT_Bits.FORCE_AUTO_CMD12_NOT_EXEC */
#define IFX_SDMMC_FORCE_AUTO_CMD_STAT_FORCE_AUTO_CMD12_NOT_EXEC_LEN (1u)

/** \brief Mask for Ifx_SDMMC_FORCE_AUTO_CMD_STAT_Bits.FORCE_AUTO_CMD12_NOT_EXEC */
#define IFX_SDMMC_FORCE_AUTO_CMD_STAT_FORCE_AUTO_CMD12_NOT_EXEC_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_FORCE_AUTO_CMD_STAT_Bits.FORCE_AUTO_CMD12_NOT_EXEC */
#define IFX_SDMMC_FORCE_AUTO_CMD_STAT_FORCE_AUTO_CMD12_NOT_EXEC_OFF (0u)

/** \brief Length for Ifx_SDMMC_FORCE_AUTO_CMD_STAT_Bits.FORCE_AUTO_CMD_TOUT_ERR */
#define IFX_SDMMC_FORCE_AUTO_CMD_STAT_FORCE_AUTO_CMD_TOUT_ERR_LEN (1u)

/** \brief Mask for Ifx_SDMMC_FORCE_AUTO_CMD_STAT_Bits.FORCE_AUTO_CMD_TOUT_ERR */
#define IFX_SDMMC_FORCE_AUTO_CMD_STAT_FORCE_AUTO_CMD_TOUT_ERR_MSK (0x1u)

