dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC33xED/IfxSdmmc_bf.h
/** \brief Offset for Ifx_SDMMC_PRESET_HS_Bits.DRV_SEL_VAL */
#define IFX_SDMMC_PRESET_HS_DRV_SEL_VAL_OFF (14u)

/** \brief Length for Ifx_SDMMC_ADMA_ID_LOW_Bits.ADMA_ID_LOW */
#define IFX_SDMMC_ADMA_ID_LOW_ADMA_ID_LOW_LEN (32u)

/** \brief Mask for Ifx_SDMMC_ADMA_ID_LOW_Bits.ADMA_ID_LOW */
#define IFX_SDMMC_ADMA_ID_LOW_ADMA_ID_LOW_MSK (0xffffffffu)

/** \brief Offset for Ifx_SDMMC_ADMA_ID_LOW_Bits.ADMA_ID_LOW */
#define IFX_SDMMC_ADMA_ID_LOW_ADMA_ID_LOW_OFF (0u)

/** \brief Length for Ifx_SDMMC_P_VENDOR_SPECIFIC_AREA_Bits.REG_OFFSET_ADDR */
#define IFX_SDMMC_P_VENDOR_SPECIFIC_AREA_REG_OFFSET_ADDR_LEN (12u)

/** \brief Mask for Ifx_SDMMC_P_VENDOR_SPECIFIC_AREA_Bits.REG_OFFSET_ADDR */
#define IFX_SDMMC_P_VENDOR_SPECIFIC_AREA_REG_OFFSET_ADDR_MSK (0xfffu)

/** \brief Offset for Ifx_SDMMC_P_VENDOR_SPECIFIC_AREA_Bits.REG_OFFSET_ADDR */
#define IFX_SDMMC_P_VENDOR_SPECIFIC_AREA_REG_OFFSET_ADDR_OFF (0u)

/** \brief Length for Ifx_SDMMC_P_VENDOR2_SPECIFIC_AREA_Bits.REG_OFFSET_ADDR */
#define IFX_SDMMC_P_VENDOR2_SPECIFIC_AREA_REG_OFFSET_ADDR_LEN (12u)

/** \brief Mask for Ifx_SDMMC_P_VENDOR2_SPECIFIC_AREA_Bits.REG_OFFSET_ADDR */
#define IFX_SDMMC_P_VENDOR2_SPECIFIC_AREA_REG_OFFSET_ADDR_MSK (0xfffu)

/** \brief Offset for Ifx_SDMMC_P_VENDOR2_SPECIFIC_AREA_Bits.REG_OFFSET_ADDR */
#define IFX_SDMMC_P_VENDOR2_SPECIFIC_AREA_REG_OFFSET_ADDR_OFF (0u)

/** \brief Length for Ifx_SDMMC_SLOT_INTR_STATUS_Bits.INTR_SLOT */
#define IFX_SDMMC_SLOT_INTR_STATUS_INTR_SLOT_LEN (8u)

/** \brief Mask for Ifx_SDMMC_SLOT_INTR_STATUS_Bits.INTR_SLOT */
#define IFX_SDMMC_SLOT_INTR_STATUS_INTR_SLOT_MSK (0xffu)

/** \brief Offset for Ifx_SDMMC_SLOT_INTR_STATUS_Bits.INTR_SLOT */
#define IFX_SDMMC_SLOT_INTR_STATUS_INTR_SLOT_OFF (0u)

/** \brief Length for Ifx_SDMMC_HOST_CNTRL_VERS_Bits.SPEC_VERSION_NUM */
#define IFX_SDMMC_HOST_CNTRL_VERS_SPEC_VERSION_NUM_LEN (8u)

/** \brief Mask for Ifx_SDMMC_HOST_CNTRL_VERS_Bits.SPEC_VERSION_NUM */
#define IFX_SDMMC_HOST_CNTRL_VERS_SPEC_VERSION_NUM_MSK (0xffu)

/** \brief Offset for Ifx_SDMMC_HOST_CNTRL_VERS_Bits.SPEC_VERSION_NUM */
#define IFX_SDMMC_HOST_CNTRL_VERS_SPEC_VERSION_NUM_OFF (0u)

/** \brief Length for Ifx_SDMMC_HOST_CNTRL_VERS_Bits.VENDOR_VERSION_NUM */
#define IFX_SDMMC_HOST_CNTRL_VERS_VENDOR_VERSION_NUM_LEN (8u)

/** \brief Mask for Ifx_SDMMC_HOST_CNTRL_VERS_Bits.VENDOR_VERSION_NUM */
#define IFX_SDMMC_HOST_CNTRL_VERS_VENDOR_VERSION_NUM_MSK (0xffu)

/** \brief Offset for Ifx_SDMMC_HOST_CNTRL_VERS_Bits.VENDOR_VERSION_NUM */
#define IFX_SDMMC_HOST_CNTRL_VERS_VENDOR_VERSION_NUM_OFF (8u)

/** \brief Length for Ifx_SDMMC_MSHC_VER_ID_Bits.MSHC_VER_ID */
#define IFX_SDMMC_MSHC_VER_ID_MSHC_VER_ID_LEN (32u)

/** \brief Mask for Ifx_SDMMC_MSHC_VER_ID_Bits.MSHC_VER_ID */
#define IFX_SDMMC_MSHC_VER_ID_MSHC_VER_ID_MSK (0xffffffffu)

/** \brief Offset for Ifx_SDMMC_MSHC_VER_ID_Bits.MSHC_VER_ID */
#define IFX_SDMMC_MSHC_VER_ID_MSHC_VER_ID_OFF (0u)

/** \brief Length for Ifx_SDMMC_MSHC_VER_TYPE_Bits.MSHC_VER_TYPE */
#define IFX_SDMMC_MSHC_VER_TYPE_MSHC_VER_TYPE_LEN (32u)

/** \brief Mask for Ifx_SDMMC_MSHC_VER_TYPE_Bits.MSHC_VER_TYPE */
#define IFX_SDMMC_MSHC_VER_TYPE_MSHC_VER_TYPE_MSK (0xffffffffu)

/** \brief Offset for Ifx_SDMMC_MSHC_VER_TYPE_Bits.MSHC_VER_TYPE */
#define IFX_SDMMC_MSHC_VER_TYPE_MSHC_VER_TYPE_OFF (0u)

/** \brief Length for Ifx_SDMMC_MBIU_CTRL_Bits.UNDEFL_INCR_EN */
#define IFX_SDMMC_MBIU_CTRL_UNDEFL_INCR_EN_LEN (1u)

/** \brief Mask for Ifx_SDMMC_MBIU_CTRL_Bits.UNDEFL_INCR_EN */
#define IFX_SDMMC_MBIU_CTRL_UNDEFL_INCR_EN_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_MBIU_CTRL_Bits.UNDEFL_INCR_EN */
#define IFX_SDMMC_MBIU_CTRL_UNDEFL_INCR_EN_OFF (0u)

/** \brief Length for Ifx_SDMMC_MBIU_CTRL_Bits.BURST_INCR4_EN */
#define IFX_SDMMC_MBIU_CTRL_BURST_INCR4_EN_LEN (1u)

/** \brief Mask for Ifx_SDMMC_MBIU_CTRL_Bits.BURST_INCR4_EN */
#define IFX_SDMMC_MBIU_CTRL_BURST_INCR4_EN_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_MBIU_CTRL_Bits.BURST_INCR4_EN */
#define IFX_SDMMC_MBIU_CTRL_BURST_INCR4_EN_OFF (1u)

/** \brief Length for Ifx_SDMMC_MBIU_CTRL_Bits.BURST_INCR8_EN */
#define IFX_SDMMC_MBIU_CTRL_BURST_INCR8_EN_LEN (1u)

/** \brief Mask for Ifx_SDMMC_MBIU_CTRL_Bits.BURST_INCR8_EN */
#define IFX_SDMMC_MBIU_CTRL_BURST_INCR8_EN_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_MBIU_CTRL_Bits.BURST_INCR8_EN */
#define IFX_SDMMC_MBIU_CTRL_BURST_INCR8_EN_OFF (2u)

/** \brief Length for Ifx_SDMMC_MBIU_CTRL_Bits.BURST_INCR16_EN */
#define IFX_SDMMC_MBIU_CTRL_BURST_INCR16_EN_LEN (1u)

/** \brief Mask for Ifx_SDMMC_MBIU_CTRL_Bits.BURST_INCR16_EN */
#define IFX_SDMMC_MBIU_CTRL_BURST_INCR16_EN_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_MBIU_CTRL_Bits.BURST_INCR16_EN */
#define IFX_SDMMC_MBIU_CTRL_BURST_INCR16_EN_OFF (3u)

/** \brief Length for Ifx_SDMMC_EMMC_CTRL_Bits.CARD_IS_EMMC */
#define IFX_SDMMC_EMMC_CTRL_CARD_IS_EMMC_LEN (1u)

/** \brief Mask for Ifx_SDMMC_EMMC_CTRL_Bits.CARD_IS_EMMC */
#define IFX_SDMMC_EMMC_CTRL_CARD_IS_EMMC_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_EMMC_CTRL_Bits.CARD_IS_EMMC */
#define IFX_SDMMC_EMMC_CTRL_CARD_IS_EMMC_OFF (0u)

/** \brief Length for Ifx_SDMMC_EMMC_CTRL_Bits.DISABLE_DATA_CRC_CHK */
#define IFX_SDMMC_EMMC_CTRL_DISABLE_DATA_CRC_CHK_LEN (1u)

/** \brief Mask for Ifx_SDMMC_EMMC_CTRL_Bits.DISABLE_DATA_CRC_CHK */
#define IFX_SDMMC_EMMC_CTRL_DISABLE_DATA_CRC_CHK_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_EMMC_CTRL_Bits.DISABLE_DATA_CRC_CHK */
#define IFX_SDMMC_EMMC_CTRL_DISABLE_DATA_CRC_CHK_OFF (1u)

/** \brief Length for Ifx_SDMMC_EMMC_CTRL_Bits.ENH_STROBE_ENABLE */
#define IFX_SDMMC_EMMC_CTRL_ENH_STROBE_ENABLE_LEN (1u)

/** \brief Mask for Ifx_SDMMC_EMMC_CTRL_Bits.ENH_STROBE_ENABLE */
#define IFX_SDMMC_EMMC_CTRL_ENH_STROBE_ENABLE_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_EMMC_CTRL_Bits.ENH_STROBE_ENABLE */
#define IFX_SDMMC_EMMC_CTRL_ENH_STROBE_ENABLE_OFF (8u)

/** \brief Length for Ifx_SDMMC_EMMC_CTRL_Bits.CQE_ALGO_SEL */
#define IFX_SDMMC_EMMC_CTRL_CQE_ALGO_SEL_LEN (1u)

/** \brief Mask for Ifx_SDMMC_EMMC_CTRL_Bits.CQE_ALGO_SEL */
#define IFX_SDMMC_EMMC_CTRL_CQE_ALGO_SEL_MSK (0x1u)

